CSI API ETABS v1
cLineElm.GetModifiers Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetModifiers(
	string Name,
	ref double[] Value
)
Function GetModifiers (
	Name As String,
	ByRef Value As Double()
) As Integer
Dim instance As cLineElm
Dim Name As String
Dim Value As Double()
Dim returnValue As Integer
returnValue = instance.GetModifiers(Name,
	Value)
int GetModifiers(
	String^ Name,
	array<double>^% Value
)
abstract GetModifiers :
        Name : string *
        Value : float[] byref -> int
Parameters
Name
Type: System.String
Value
Type: System.Double[]
Return Value
Type: Int32
See Also
Reference
cLineElm Interface
ETABSv1 Namespace